nxp-mcuxpresso/mcux-sdk-examples/mimxrt685audevk/usb_examples/usb_device_mtp/freertos/mtp.c
/* USB device class configuration information */
usb_device_class_config_list_struct_t mtp_config_list = {
    mtp_config,
    USB_DeviceCallback,
    1,
};

/*!
 * @brief device application init function.
 *
 * This function init the usb stack and sdhc driver.
 *
 * @return None.
 */
void USB_DeviceApplicationInit(void)
{
    USB_DeviceClockInit();
#if (defined(FSL_FEATURE_SOC_SYSMPU_COUNT) && (FSL_FEATURE_SOC_SYSMPU_COUNT > 0U))
    SYSMPU_Enable(SYSMPU, 0);
#endif /* FSL_FEATURE_SOC_SYSMPU_COUNT */

    usb_echo("Please insert disk\r\n");

    g_mtp.devPropDescList = &g_DevPropDescList;
    g_mtp.storageList     = &g_StorageList;
    g_mtp.objPropList     = &g_ObjPropList;
    g_mtp.devFriendlyName = &g_DevFriendlyName[0];
    g_mtp.path            = (uint8_t *)&g_pathBuffer[0];

    g_mtp.speed              = USB_SPEED_FULL;
    g_mtp.attach             = 0;
    g_mtp.mtpHandle          = (class_handle_t)NULL;
    g_mtp.deviceHandle       = NULL;
    g_mtp.mutexUsbToDiskTask = 0U;

    g_mtp.queueHandle = xQueueCreate(1U, sizeof(usb_mtp_disk_operation_msgq_struct_t));
    if (NULL == g_mtp.queueHandle)
    {
        usb_echo("Queue create failed\r\n");
    }

    if (kStatus_USB_Success != USB_DeviceMtpFSInit((const uint16_t *)g_mtp.storageList->storageInfo[0].rootPath))
    {
        usb_echo("Disk init failed\r\n");
    }

    if (kStatus_USB_Success != USB_DeviceClassInit(CONTROLLER_ID, &mtp_config_list, &g_mtp.deviceHandle))
    {
        usb_echo("USB device init failed\r\n");
    }
    else
    {
        usb_echo("USB device mtp demo\r\n");
        g_mtp.mtpHandle = mtp_config_list.config->classHandle;
    }

    USB_DeviceIsrEnable();

    /*Add one delay here to make the DP pull down long enough to allow host to detect the previous disconnection.*/
    SDK_DelayAtLeastUs(5000, SDK_DEVICE_MAXIMUM_CPU_CLOCK_FREQUENCY);
    USB_DeviceRun(g_mtp.deviceHandle);
}

#if USB_DEVICE_CONFIG_USE_TASK
void USB_DeviceTask(void *handle)
{
    while (1U)
    {
        USB_DeviceTaskFn(handle);
    }
}
#endif

void USB_DeviceDiskOperationTask(void *arg)
{
    usb_mtp_disk_operation_msgq_struct_t msgQ;
    usb_device_mtp_response_struct_t response;

    while (1)
    {
        if (pdTRUE == xQueueReceive(g_mtp.queueHandle, &msgQ, portMAX_DELAY))
        {
            g_mtp.mutexUsbToDiskTask = 1U;
            switch (msgQ.event)
            {
                case kUSB_DeviceMtpEventDeleteObj:
                    USB_DeviceCmdDeleteObj(&msgQ.dataInfo);
                    break;

                case kUSB_DeviceMtpEventCopyObj:
                    USB_DeviceCmdCopyObj(&msgQ.dataInfo);
                    break;

                default:
                    /* no action */
                    break;
            }
            g_mtp.mutexUsbToDiskTask = 0U;

            if ((pdTRUE == xQueuePeek(g_mtp.queueHandle, &msgQ, 0)) &&
                ((msgQ.dataInfo.curPhase == USB_DEVICE_MTP_PHASE_CANCELLATION) ||
                 (msgQ.event == kUSB_DeviceMtpEventDeviceResetRequest)))
            {
                /* If receiving cancellation or reset request during the above opertions, do not send reponse */
            }
            else
            {
                response.code        = msgQ.dataInfo.code;
                response.paramNumber = msgQ.dataInfo.curSize;
                while (msgQ.dataInfo.curSize != 0U)
                {
                    msgQ.dataInfo.curSize--;
                    ((uint32_t *)&response.param1)[msgQ.dataInfo.curSize] = msgQ.dataInfo.param[msgQ.dataInfo.curSize];
                }

                USB_DeviceMtpResponseSend(g_mtp.mtpHandle, &response);
            }
        }
    }
}

void APP_task(void *handle)
{
    USB_DeviceApplicationInit();

    if (g_mtp.deviceHandle)
    {
#if USB_DEVICE_CONFIG_USE_TASK
        if (xTaskCreate(USB_DeviceTask,                  /* pointer to the task */
                        (char const *)"usb device task", /* task name for kernel awareness debugging */
                        5000L / sizeof(portSTACK_TYPE),  /* task stack size */
                        g_mtp.deviceHandle,              /* optional task startup argument */
                        5,                               /* initial priority */
                        &g_mtp.device_task_handle        /* optional task handle to create */
                        ) != pdPASS)
        {
            usb_echo("usb device task create failed!\r\n");
            return;
        }

#if USB_DEVICE_CONFIG_USE_EVENT_TASK
        if (xTaskCreate(USB_DeviceEventTask,                   /* pointer to the task */
                        (char const *)"usb device event task", /* task name for kernel awareness debugging */
                        3000L / sizeof(portSTACK_TYPE),        /* task stack size */
                        &g_mtp,                                /* optional task startup argument */
                        4,                                     /* initial priority */
                        NULL                                   /* optional task handle to create */
                        ) != pdPASS)
        {
            usb_echo("usb device event task create failed!\r\n");
            return;
        }
#endif
#endif
        if (xTaskCreate(USB_DeviceDiskOperationTask,    /* pointer to the task */
                        (char const *)"usb disk task",  /* task name for kernel awareness debugging */
                        5000L / sizeof(portSTACK_TYPE), /* task stack size */
                        NULL,                           /* optional task startup argument */
                        4,                              /* initial priority */
                        &g_mtp.device_disk_task_handle  /* optional task handle to create */
                        ) != pdPASS)
        {
            usb_echo("usb device disk task create failed!\r\n");
            return;
        }
    }

    while (1)
    {
    }
}

#if defined(__CC_ARM) || (defined(__ARMCC_VERSION)) || defined(__GNUC__)
int main(void)
#else
void main(void)
#endif
{
    BOARD_InitBootPins();
    BOARD_InitBootClocks();
    BOARD_SD_Config(&g_sd, NULL, USB_DEVICE_INTERRUPT_PRIORITY - 1U, NULL);
    BOARD_InitDebugConsole();

    if (xTaskCreate(APP_task,                       /* pointer to the task */
                    (char const *)"app task",       /* task name for kernel awareness debugging */
                    5000L / sizeof(portSTACK_TYPE), /* task stack size */
                    &g_mtp,                         /* optional task startup argument */
                    3,                              /* initial priority */
                    &g_mtp.application_task_handle  /* optional task handle to create */
                    ) != pdPASS)
    {
        usb_echo("app task create failed!\r\n");
#if (defined(__CC_ARM) || (defined(__ARMCC_VERSION)) || defined(__GNUC__))
        return 1;
#else
        return;
#endif
    }
    vTaskStartScheduler();

#if (defined(__CC_ARM) || (defined(__ARMCC_VERSION)) || defined(__GNUC__))
    return 1;
#endif
}
